DROP TABLE IF EXISTS `students`;

CREATE TABLE `students` (
  `sNo` char(8) NOT NULL,
  `sPassword` varchar(12) NOT NULL,
  `sName` varchar(10) NOT NULL,
  `sMajor` varchar(20) NOT NULL,
  `sCard` char(18) NOT NULL,
  `sMobile` char(11) DEFAULT NULL,
  `sSex` char(2) DEFAULT NULL,
  `sAge` int(11) DEFAULT '22',
  PRIMARY KEY (`sNo`),
  UNIQUE KEY `sCard` (`sCard`),
  UNIQUE KEY `sMobile` (`sMobile`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `students` */

insert  into `students`(`sNo`,`sPassword`,`sName`,`sMajor`,`sCard`,`sMobile`,`sSex`,`sAge`) values ('20180001','19901225','张三','计算机科学与技术','512527199012252693','12345678998','男',22),('20180002','19901015','李四','软件工程','512527199010152693',NULL,'男',21),('20180003','19900101','王五','计算机科学与技术','512527199001012693',NULL,'男',21),('20180004','19900102','嘟嘟妹','软件工程','512527199001012694',NULL,'女',22),('20180005','19900102','朵朵','软件工程','512527199002013289',NULL,'女',22),('20180006','19900102','沫沫','计算机科学与技术','512567199002013289',NULL,'女',20),('20180007','19900102','一姐','物联网技术','512527199002013389','','女',18),('20180008','19900102','晨宝','计算机科学与技术','512527199102013289',NULL,'女',18),('20180009','19900102','王成松','计算机科学与技术','512527179002013289',NULL,'男',21),('20180010','19900102','黄亮','计算机科学与技术','512527123002013289',NULL,'男',20),('20180011','19900102','杨杰','计算机科学与技术','512527199032013289',NULL,'男',23),('20180012','19900102','刘瑞琪','计算机科学与技术','512527191002013289',NULL,'男',25),('20180013','19900102','熊浩','计算机科学与技术','512527135042013289',NULL,'男',20),('20180014','19900102','马宏宇','计算机科学与技术','512527435042013289',NULL,'女',19),('20180015','19900102','李理','计算机科学与技术','512527136042013289',NULL,'女',20),('20180016','19900102','邓仕强','计算机科学与技术','512527735042013289',NULL,'男',20),('20180017','19900102','黄宇','计算机科学与技术','512527135082013289',NULL,'男',21),('20180018','19900102','唐科林','计算机科学','534527135042013289',NULL,'男',20),('20180019','19900102','王俊','计算机科学与技术','512527132542013289',NULL,'男',20),('20180020','19900102','汤仁蓓','软件工程','512527131142013289',NULL,'女',20),('20180021','19900102','刘玉玲','计算机科学与技术','512887135042013289',NULL,'男',20);